Neothai/esp32p4_test/main/main.c
// เจอบั๊ก (001) เมื่อเล่นวิดีโอ 40 นาที ไปประมาณ 10 นาทีกว่าๆ ก็เกิดอาการค้างทั้งภาพและเสียง

#include <stdio.h>
#include <string.h>
#include <strings.h>
#include <time.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "esp_http_client.h"
#include "esp32_wifi.h"
#include "sd_protocol_types.h"
#include "driver/sdmmc_host.h"
#include "sdmmc_cmd.h"
#include "ff.h"
#include "diskio.h"
#include "driver/i2c_master.h"
#include "driver/spi_master.h"
#include "sd_pwr_ctrl_by_on_chip_ldo.h"

#include "driver/gpio.h"
#include "esp_heap_caps.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_panel_io.h"
#include "esp_ldo_regulator.h"
#include "esp_dma_utils.h"
#include "esp_lcd_mipi_dsi.h"
#include "esp_lcd_ek79007.h"
#include "esp_idf_version.h"
#include "lvgl.h"
#include "esp_lvgl_port.h"
#include "demos/lv_demos.h"

#include "driver/jpeg_decode.h"
#include "avilib.h"
#include "freertos/ringbuf.h"
#include "esp32_mp3dec.h"
#include "helix/pub/mp3dec.h"
#include "esp32_avidec.h"
#include "es8311.c"

#include "driver/i2c_master.h"
#include "esp_lcd_touch_gt911.h"

#define PIN_NUM_CLK    GPIO_NUM_43
#define PIN_NUM_CMD    GPIO_NUM_44
#define PIN_NUM_D0     GPIO_NUM_39
#define PIN_NUM_D1     GPIO_NUM_40
#define PIN_NUM_D2     GPIO_NUM_41
#define PIN_NUM_D3     GPIO_NUM_42

// ขา I2S สำหรับ ES8311
#define I2S_MCLK_IO       GPIO_NUM_13
#define I2S_BCLK_IO       GPIO_NUM_12
#define I2S_WS_IO         GPIO_NUM_10
#define I2S_DOUT_IO       GPIO_NUM_9

// ขาเปิดเพาเวอร์แอมป์ลำโพง (ขึ้นอยู่กับแบบวงจรของบอร์ด เช่น GPIO 26, 53 หรือ 45)
#define PA_ENABLE_GPIO    GPIO_NUM_53

#define BENCH_FILE_PATH   "0:/bench.tmp"
#define BENCH_TOTAL_BYTES (64 * 1024 * 1024)
#define BENCH_CHUNK_SIZE  (64 * 1024)

#define TAG_FS "SD_FILES"
#define MAX_DEPTH    6     // จำกัดความลึกสูงสุดไม่เกิน 6 ระดับชั้น
#define MAX_PATH_LEN 512

// ── กำหนดขา GPIO ของ Touch IC ตามบอร์ดของคุณ ──
#define TOUCH_I2C_SDA         GPIO_NUM_7
#define TOUCH_I2C_SCL         GPIO_NUM_8
#define TOUCH_PIN_INT         GPIO_NUM_NC
#define TOUCH_PIN_RST         GPIO_NUM_23

#define TAG "LVGL_P4"

#define LCD_H_RES              1024
#define LCD_V_RES              600
#define PIN_NUM_BK_LIGHT       GPIO_NUM_32
#define PIN_NUM_LCD_RST        GPIO_NUM_33

static esp_ldo_channel_handle_t ldo_mipi_phy = NULL;
static esp_lcd_panel_handle_t panel_handle = NULL;
static esp_lcd_dsi_bus_handle_t mipi_dsi_bus = NULL;
static esp_lcd_panel_io_handle_t mipi_dbi_io = NULL;

static SemaphoreHandle_t s_draw_done_sem = NULL;
static RingbufHandle_t   s_audio_ringbuf = NULL;
static i2s_chan_handle_t s_i2s_tx_chan = NULL;
static volatile bool     s_audio_flush = false;
static volatile bool     s_audio_paused = false;

static esp32_avidec_t    s_player;
esp32_mp3dec_t           mp3;

// ตัวแปรส่วนจัดการถอดรหัสภาพระดับ Global
static jpeg_decoder_handle_t s_jpeg_dec = NULL;
static jpeg_decode_cfg_t     s_dec_cfg;
static uint8_t              *s_video_fb[2] = {NULL, NULL};
static int                   s_fb_idx = 0;
static uint32_t              s_aligned_w = 0;
static uint32_t              s_v_height = 0;
static size_t                s_out_pixel_bytes = 0;
static int                   s_x_start = 0;
static int                   s_y_start = 0;

esp_err_t display_jpeg_direct(esp_lcd_panel_handle_t panel, const char *file_path);

/* ── ฟังก์ชันเปิดไฟ Backlight ───────────────────────────────────── */
static void bsp_enable_backlight(void) {
    gpio_config_t bk_gpio_config = {
        .mode = GPIO_MODE_OUTPUT,
        .pin_bit_mask = 1ULL << PIN_NUM_BK_LIGHT
    };
    gpio_config(&bk_gpio_config);
    gpio_set_level(PIN_NUM_BK_LIGHT, 0);
}

static esp_lcd_touch_handle_t tp_handle = NULL;

static void setup_touchscreen(lv_display_t *display) {
    ESP_LOGI(TAG, "Initializing Touchscreen (GT911)...");

    // 1. เริ่มระบบ I2C Master Bus (IDF v6.x Driver)
    i2c_master_bus_config_t i2c_bus_config = {
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .i2c_port = I2C_NUM_0,
        .scl_io_num = TOUCH_I2C_SCL,
        .sda_io_num = TOUCH_I2C_SDA,
        .glitch_ignore_cnt = 7,
        .flags.enable_internal_pullup = true,
    };
    i2c_master_bus_handle_t i2c_bus_handle;
    ESP_ERROR_CHECK(i2c_new_master_bus(&i2c_bus_config, &i2c_bus_handle));

    vTaskDelay(pdMS_TO_TICKS(50));

    // 2. ผูก I2C IO เข้ากับ Touch Panel
    esp_lcd_panel_io_handle_t tp_io_handle = NULL;
    esp_lcd_panel_io_i2c_config_t tp_io_config = ESP_LCD_TOUCH_IO_I2C_GT911_CONFIG();
    tp_io_config.scl_speed_hz = 400000;
    ESP_ERROR_CHECK(esp_lcd_new_panel_io_i2c(i2c_bus_handle, &tp_io_config, &tp_io_handle));

    // 3. กำหนดค่าคอนฟิกของ GT911
    esp_lcd_touch_config_t tp_cfg = {
        .x_max = LCD_H_RES,
        .y_max = LCD_V_RES,
        .rst_gpio_num = TOUCH_PIN_RST,
        .int_gpio_num = TOUCH_PIN_INT,
        .levels = {
            .reset = 0,
            .interrupt = 0,
        },
        .flags = {
            // หากคุณกลับหัวจอ 180 องศา ให้สลับแกนพิกัดสัมผัสตรงนี้:
            .swap_xy = 0,
            .mirror_x = 1, // กลับแกน X ให้ตรงกับภาพที่หมุน 180°
            .mirror_y = 1, // กลับแกน Y ให้ตรงกับภาพที่หมุน 180°
        },
    };
    ESP_ERROR_CHECK(esp_lcd_touch_new_i2c_gt911(tp_io_handle, &tp_cfg, &tp_handle));

    // 4. ลงทะเบียนเข้ากับ esp_lvgl_port
    const lvgl_port_touch_cfg_t touch_cfg = {
        .disp = display,
        .handle = tp_handle,
    };
    lv_indev_t *touch_indev = lvgl_port_add_touch(&touch_cfg);
    if (touch_indev == NULL) {
        ESP_LOGE(TAG, "Failed to register touch indev to LVGL");
    }
}

FIL file;
static FATFS g_fatfs;
static sdmmc_card_t s_card_info;

// Callback ทำงานเมื่อ DMA2D ส่งภาพเฟรมก่อนหน้าเสร็จเรียบร้อย
static bool on_color_trans_done_cb(esp_lcd_panel_handle_t panel, 
                                   esp_lcd_dpi_panel_event_data_t *edata, 
                                   void *user_ctx)
{
    BaseType_t need_yield = pdFALSE;
    xSemaphoreGiveFromISR(s_draw_done_sem, &need_yield);
    return (need_yield == pdTRUE);
}

static bool is_jpeg_file(const char *filename)
{
    const char *dot = strrchr(filename, '.');
    if (!dot) return false;
    return (strcasecmp(dot, ".jpg") == 0 || strcasecmp(dot, ".jpeg") == 0);
}

static void bsp_enable_speaker_pa(void) {
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << PA_ENABLE_GPIO),
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,
    };
    gpio_config(&io_conf);
    gpio_set_level(PA_ENABLE_GPIO, 1); // สั่ง High เพื่อเปิดวงจรขยายเสียง
}

#define AUDIO_ACCUM_BUF_SIZE (8 * 1024)

static void avi_audio_stream_task(void *pvParam) {
    HMP3Decoder mp3_dec = MP3InitDecoder();
    int16_t *pcm_out = (int16_t *)malloc(1152 * 2 * sizeof(int16_t));
    MP3FrameInfo frame_info;
    s_i2s_tx_chan = mp3.i2s_hnd;

    uint8_t *accum_buf = (uint8_t *)malloc(AUDIO_ACCUM_BUF_SIZE);
    int accum_bytes = 0;
    uint32_t current_sample_rate = 0;

    while (1) {
        if (s_audio_paused) {
            vTaskDelay(pdMS_TO_TICKS(20));
            continue;
        }

        if (s_audio_flush) {
            accum_bytes = 0;
            s_audio_flush = false;
        }

        size_t item_size = 0;
        // ปรับเวลารอจาก portMAX_DELAY เป็น 50ms เพื่อให้วนกลับมาเช็ค s_audio_paused ได้
        uint8_t *chunk = (uint8_t *)xRingbufferReceive(s_audio_ringbuf, &item_size, pdMS_TO_TICKS(50));
        if (!chunk) continue;

        if (accum_bytes + item_size <= AUDIO_ACCUM_BUF_SIZE) {
            memcpy(accum_buf + accum_bytes, chunk, item_size);
            accum_bytes += item_size;
        } else {
            accum_bytes = 0;
        }
        vRingbufferReturnItem(s_audio_ringbuf, (void *)chunk);

        int bytes_left = accum_bytes;
        unsigned char *read_ptr = accum_buf;

        while (bytes_left > 0) {
            int offset = MP3FindSyncWord(read_ptr, bytes_left);
            if (offset < 0) {
                bytes_left = 0;
                break;
            }

            read_ptr += offset;
            bytes_left -= offset;

            int err = MP3Decode(mp3_dec, &read_ptr, &bytes_left, pcm_out, 0);
            if (err == ERR_MP3_NONE) {
                MP3GetLastFrameInfo(mp3_dec, &frame_info);

                if (frame_info.samprate > 0 && frame_info.samprate != current_sample_rate) {
                    current_sample_rate = frame_info.samprate;
                    i2s_std_clk_config_t clk_cfg = I2S_STD_CLK_DEFAULT_CONFIG(current_sample_rate);
                    clk_cfg.mclk_multiple = I2S_MCLK_MULTIPLE_256;
                    i2s_channel_disable(s_i2s_tx_chan);
                    i2s_channel_reconfig_std_clock(s_i2s_tx_chan, &clk_cfg);
                    i2s_channel_enable(s_i2s_tx_chan);
                }

                size_t pcm_bytes = 0;
                if (frame_info.nChans == 1) {
                    for (int i = frame_info.outputSamps - 1; i >= 0; i--) {
                        pcm_out[i * 2]     = pcm_out[i];
                        pcm_out[i * 2 + 1] = pcm_out[i];
                    }
                    pcm_bytes = frame_info.outputSamps * 2 * sizeof(int16_t);
                } else {
                    pcm_bytes = frame_info.outputSamps * sizeof(int16_t);
                }

                size_t written = 0;
                i2s_channel_write(s_i2s_tx_chan, pcm_out, pcm_bytes, &written, portMAX_DELAY);
            } else if (err == ERR_MP3_INDATA_UNDERFLOW) {
                break;
            } else {
                if (bytes_left > 0) {
                    read_ptr++;
                    bytes_left--;
                }
            }
        }

        if (bytes_left > 0 && read_ptr != accum_buf) {
            memmove(accum_buf, read_ptr, bytes_left);
        }
        accum_bytes = bytes_left;
    }
}

// Callback รับข้อมูลเฟรมภาพ
static void on_video_frame(const uint8_t *data, size_t len, uint32_t frame_idx, void *user_ctx) {
    uint32_t out_bytes = 0;
    esp_err_t err = jpeg_decoder_process(s_jpeg_dec, &s_dec_cfg, 
                                         data, len,
                                         s_video_fb[s_fb_idx], s_out_pixel_bytes, &out_bytes);
    if (err == ESP_OK) {
        if (xSemaphoreTake(s_draw_done_sem, pdMS_TO_TICKS(50)) == pdTRUE) {
            esp_lcd_panel_draw_bitmap(panel_handle, s_x_start, s_y_start, 
                                      s_x_start + s_aligned_w, s_y_start + s_v_height, 
                                      s_video_fb[s_fb_idx]);
            s_fb_idx ^= 1;
        } else {
            xSemaphoreGive(s_draw_done_sem);
        }
    }
}

