Neothai/esp32p4_test/main/main.c
// Callback รับก้อนเสียง MP3
static void on_audio_chunk(const uint8_t *data, size_t len, void *user_ctx) {
  if (s_audio_ringbuf && !s_audio_paused) {
        // ใช้ timeout = 0 (ไม่รอ) เพื่อให้ลูปภาพเดินหน้าต่อได้อย่างลื่นไหล
        xRingbufferSend(s_audio_ringbuf, data, len, 0);
  }
}

// Callback รับสถานะการเล่น
static void on_player_event(esp32_avidec_event_t event, void *event_data, void *user_ctx) {
    if (event == ESP32_AVIDEC_EVENT_STATE_CHANGED) {
        esp32_avidec_state_t st = (esp32_avidec_state_t)(uintptr_t)event_data;
        
        if (st == ESP32_AVIDEC_STATE_PAUSED) {
            s_audio_paused = true;
            // ปิดช่องสัญญาณ I2S ทันที เสียงจะตัดเงียบสนิท 100%
            if (s_i2s_tx_chan) {
                i2s_channel_disable(s_i2s_tx_chan);
            }
            ESP_LOGI(TAG, "Audio Paused (I2S Disabled)");
        } 
        else if (st == ESP32_AVIDEC_STATE_PLAYING) {
            // เปิดช่องสัญญาณ I2S กลับคืนมาเพื่อเล่นต่อ
            if (s_i2s_tx_chan) {
                i2s_channel_enable(s_i2s_tx_chan);
            }
            s_audio_paused = false;
            ESP_LOGI(TAG, "Audio Resumed (I2S Enabled)");
        } 
        else if (st == ESP32_AVIDEC_STATE_STOPPED) {
            s_audio_paused = true;
            if (s_i2s_tx_chan) {
                i2s_channel_disable(s_i2s_tx_chan);
            }
            // ล้างข้อมูลเสียงตกค้างใน RingBuffer ทิ้งทั้งหมด
            size_t sz = 0;
            void *item;
            while ((item = xRingbufferReceive(s_audio_ringbuf, &sz, 0)) != NULL) {
                vRingbufferReturnItem(s_audio_ringbuf, item);
            }
            s_audio_flush = true;
        }
    } 
    else if (event == ESP32_AVIDEC_EVENT_EOF) {
        ESP_LOGI(TAG, "Playback Completed!");
    } 
    else if (event == ESP32_AVIDEC_EVENT_SEEK_DONE) {
        size_t sz = 0;
        void *item;
        while ((item = xRingbufferReceive(s_audio_ringbuf, &sz, 0)) != NULL) {
            vRingbufferReturnItem(s_audio_ringbuf, item);
        }
        s_audio_flush = true;
        xSemaphoreGive(s_draw_done_sem);
    }
}

void sd_test(void *p)
{
  FRESULT fr = f_mount(&g_fatfs, "0:", 1);
    if (fr != FR_OK) {
        ESP_LOGE(TAG, "FatFS mount failed! (err=%d)", fr);
        vTaskDelete(NULL);
        return;
    }
    ESP_LOGI(TAG, "FatFS mounted successfully.");

  // [แก้ไข] จองบัฟเฟอร์โดยเผื่อ Aligned Height 608 พิกเซลเต็มพิกัด (1024 x 608 x 2 = 1,245,184 B)
    size_t fb_size = (1024 * 608 * 2) + 64;
    for (int i = 0; i < 2; i++) {
        if (!s_video_fb[i]) {
            s_video_fb[i] = (uint8_t *)heap_caps_aligned_alloc(64, fb_size, MALLOC_CAP_SPIRAM);
        }
    }

    // 2. จัดเตรียม RingBuffer และ Task สำหรับถอดรหัสเสียง
    if (!s_audio_ringbuf) {
        s_audio_ringbuf = xRingbufferCreate(64 * 1024, RINGBUF_TYPE_NOSPLIT);
        xTaskCreate(avi_audio_stream_task, "avi_audio", 8192, NULL, 5, NULL);
    }

    // 3. เริ่มต้นคอมโพเนนต์ esp32_avidec
    esp32_avidec_cfg_t cfg = ESP32_AVIDEC_CONFIG_DEFAULT();
    esp32_avidec_init(&s_player, &cfg);

    esp32_avidec_set_video_cb(&s_player, on_video_frame);
    esp32_avidec_set_audio_cb(&s_player, on_audio_chunk);
    esp32_avidec_set_event_cb(&s_player, on_player_event);

    esp32_avidec_set_file(&s_player, "0:/output.avi");

    // 4. เตรียม HW JPEG Engine ตามขนาดความละเอียดของวิดีโอที่ตรวจพบ
    if (!s_jpeg_dec) {
        jpeg_decode_engine_cfg_t eng_cfg = { .intr_priority = 0, .timeout_ms = 500 };
        ESP_ERROR_CHECK(jpeg_new_decoder_engine(&eng_cfg, &s_jpeg_dec));
    }
    s_dec_cfg.output_format = JPEG_DECODE_OUT_FORMAT_RGB565;
    s_dec_cfg.rgb_order = JPEG_DEC_RGB_ELEMENT_ORDER_BGR;

    s_v_height = s_player.height;
    s_aligned_w = (s_player.width + 15) & ~15;
    uint32_t aligned_h = (s_v_height + 15) & ~15;
    s_out_pixel_bytes = s_aligned_w * aligned_h * 2;
    s_x_start = (LCD_H_RES > s_aligned_w) ? (LCD_H_RES - s_aligned_w) / 2 : 0;
    s_y_start = (LCD_V_RES > s_v_height) ? (LCD_V_RES - s_v_height) / 2 : 0;

    ESP_LOGI(TAG, "Starting playback: %dx%d @ %.2f FPS", s_player.width, s_player.height, s_player.fps);
    esp32_avidec_play(&s_player);

    while (1) {
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

typedef struct {
    const char *name;
    uint32_t freq_khz;
    float io_voltage;
    uint32_t slot_flags;
    uint8_t bus_width;
} sd_profile_t;

// กำหนด 5 โปรไฟล์จากเร็วสุดลงไปหาปลอดภัยสุด
static const sd_profile_t s_profiles[] = {
    //{"UHS-I SDR50 (100MHz 4-bit)", SDMMC_FREQ_SDR50,   1.8f, SDMMC_SLOT_FLAG_UHS1, 4},
    {"UHS-I DDR50 (50MHz 4-bit)",  SDMMC_FREQ_DDR50,   1.8f, SDMMC_SLOT_FLAG_UHS1, 4},
    {"High-Speed (40MHz 4-bit)",   SDMMC_FREQ_HIGHSPEED, 3.3f, 0,                      4},
    {"Standard (20MHz 4-bit)",     SDMMC_FREQ_DEFAULT, 3.3f, 0,                      4},
    {"Fail-Safe (20MHz 1-bit)",     SDMMC_FREQ_DEFAULT, 3.3f, 0,                      1},
};

#define PROFILE_COUNT (sizeof(s_profiles) / sizeof(s_profiles[0]))
#define SD_PROFILE_TRY_COUNT 3

esp_err_t sd_card_init_adaptive(sdmmc_host_t *host, sdmmc_card_t *out_card_info)
{
    esp_err_t err = ESP_FAIL;

    for (size_t i = 0; i < PROFILE_COUNT; i++) {
      for(int j = 0; j < SD_PROFILE_TRY_COUNT; j++){
        vTaskDelay(pdMS_TO_TICKS(1000));
        const sd_profile_t *prof = &s_profiles[i];
        ESP_LOGW("SD_ADAPT", ">> Trying Profile [%d/%d]: %s...", (int)i + 1, (int)PROFILE_COUNT, prof->name);

        host->max_freq_khz = prof->freq_khz;
        host->io_voltage = prof->io_voltage;

        sdmmc_slot_config_t slot_config = SDMMC_SLOT_CONFIG_DEFAULT();
        slot_config.width = prof->bus_width;
        slot_config.clk = PIN_NUM_CLK;
        slot_config.cmd = PIN_NUM_CMD;
        slot_config.d0  = PIN_NUM_D0;
        slot_config.d1  = PIN_NUM_D1;
        slot_config.d2  = PIN_NUM_D2;
        slot_config.d3  = PIN_NUM_D3;
        slot_config.cd  = SDMMC_SLOT_NO_CD;
        slot_config.wp  = SDMMC_SLOT_NO_WP;
        slot_config.flags |= SDMMC_SLOT_FLAG_INTERNAL_PULLUP;
        slot_config.flags |= prof->slot_flags;

