Neothai/esp32p4_test/main/main.c
        // เชื่อมขาเข้ากับ Slot 0
        esp_err_t slot_err = sdmmc_host_init_slot(host->slot, &slot_config);
        if (slot_err != ESP_OK) {
            ESP_LOGE("SD_ADAPT", "Failed to init slot for %s", prof->name);
            sdmmc_host_deinit_slot(host->slot);
            continue;
        }

        // 4. ทดสอบตรวจสอบการ์ด (ไม่ใช้ ESP_ERROR_CHECK เพื่อไม่ให้ระบบ Panic)
        err = sdmmc_card_init(host, out_card_info);
        if (err == ESP_OK) {
            // ด่านทดสอบจริง: ลองสตรีมอ่าน 16 เซกเตอร์ (8 KB) เพื่อเช็กสัญญาณ CRC
            uint8_t *test_buf = heap_caps_aligned_alloc(64, 512 * 16, MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL);
            if (test_buf) {
                esp_err_t read_test = sdmmc_read_sectors(out_card_info, test_buf, 0, 16);
                free(test_buf);
                if (read_test == ESP_OK) {
                    ESP_LOGI("SD_ADAPT", "SUCCESS! SD Card locked & verified at: %s", prof->name);
                    return ESP_OK;
                }
                ESP_LOGW("SD_ADAPT", "Init OK but Burst Read failed on %s (CRC/Noise), stepping down...", prof->name);
            }
        }

        ESP_LOGW("SD_ADAPT", "Profile [%s] failed with err=0x%x (%s), stepping down...", 
                 prof->name, err, esp_err_to_name(err));

        sdmmc_host_deinit_slot(host->slot);
        
        // หน่วงเวลาสั้น ๆ ก่อนเริ่มสเต็ปถัดไป
        vTaskDelay(pdMS_TO_TICKS(100));
      }
    }

    return err; // ล้มเหลวครบทุกระดับ
}

#define LCD_H_RES   1024
#define LCD_V_RES   600

// บัฟเฟอร์เก็บภาพพิกเซล RGB565 ขนาด 1024 x 600 x 2 ไบต์ (~1.23 MB)
void console_task(void *pvParameters) {
    char line[64];
    int idx = 0;

    printf("\n========================================\n");
    printf("   ESP32-P4 Video CLI Console Ready     \n");
    printf("========================================\n");

    while (1) {
        int c = getchar();
        if (c == EOF || c < 0) {
            vTaskDelay(pdMS_TO_TICKS(30));
            continue;
        }

        if (c == '\r' || c == '\n') {
            if (idx == 0) {
                printf("\n>> ");
                fflush(stdout);
                continue;
            }
            line[idx] = '\0';
            printf("\n");

            int sec = 0, min = 0;
            if (sscanf(line, "seek %d:%d", &min, &sec) == 2) {
                esp32_avidec_seek(&s_player, min * 60 + sec);
            } else if (sscanf(line, "seek %d", &sec) == 1) {
                esp32_avidec_seek(&s_player, sec);
            } else if (strcmp(line, "status") == 0) {
                uint32_t cur = esp32_avidec_get_current_sec(&s_player);
                uint32_t tot = esp32_avidec_get_total_sec(&s_player);
                printf("[STATUS] %02lu:%02lu / %02lu:%02lu (State: %d)\n",
                       (unsigned long)(cur / 60), (unsigned long)(cur % 60),
                       (unsigned long)(tot / 60), (unsigned long)(tot % 60),
                       esp32_avidec_get_state(&s_player));
            } else if (strcmp(line, "pause") == 0) {
                esp32_avidec_pause(&s_player);
            } else if (strcmp(line, "resume") == 0) {
                esp32_avidec_resume(&s_player);
            } else {
                printf("Unknown command: %s\n", line);
            }

            idx = 0;
            printf(">> ");
            fflush(stdout);
        } else if (c == '\b' || c == 127) {
            if (idx > 0) {
                idx--;
                printf("\b \b");
                fflush(stdout);
            }
        } else if (idx < sizeof(line) - 1) {
            line[idx++] = (char)c;
            putchar(c);
            fflush(stdout);
        }
    }
}

void app_main(void) {
  
    ESP_LOGI(TAG, "Initializing MIPI-DSI Host...");

    ESP_LOGI(TAG, "MIPI DSI PHY Powered on");
    esp_ldo_channel_config_t ldo_mipi_phy_config = {
        .chan_id = 3,//TEST_MIPI_DSI_PHY_PWR_LDO_CHAN,
        .voltage_mv = 2500,//TEST_MIPI_DSI_PHY_PWR_LDO_VOLTAGE_MV,
    };
    ESP_ERROR_CHECK(esp_ldo_acquire_channel(&ldo_mipi_phy_config, &ldo_mipi_phy));

    ESP_LOGI(TAG, "Initialize MIPI DSI bus");
    esp_lcd_dsi_bus_config_t bus_config = EK79007_PANEL_BUS_DSI_2CH_CONFIG();
    bus_config.lane_bit_rate_mbps = 1000;
    ESP_ERROR_CHECK(esp_lcd_new_dsi_bus(&bus_config, &mipi_dsi_bus));

    ESP_LOGI(TAG, "Install panel IO");
    esp_lcd_dbi_io_config_t dbi_config = EK79007_PANEL_IO_DBI_CONFIG();
    ESP_ERROR_CHECK(esp_lcd_new_panel_io_dbi(mipi_dsi_bus, &dbi_config, &mipi_dbi_io));

    ESP_LOGI(TAG, "Install LCD driver of ek79007");
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
    esp_lcd_dpi_panel_config_t dpi_config = EK79007_1024_600_PANEL_60HZ_CONFIG_CF(LCD_COLOR_FMT_RGB565);
    dpi_config.dpi_clock_freq_mhz = 70;
    dpi_config.num_fbs = 2;
#else
    esp_lcd_dpi_panel_config_t dpi_config = EK79007_1024_600_PANEL_60HZ_CONFIG(TEST_MIPI_DPI_PX_FORMAT);
#endif
    ek79007_vendor_config_t vendor_config = {
        .mipi_config = {
            .dsi_bus = mipi_dsi_bus,
            .dpi_config = &dpi_config,
            .lane_num = 2,//TEST_MIPI_DSI_LANE_NUM,
        },
    };
    const esp_lcd_panel_dev_config_t panel_config = {
        .reset_gpio_num = 33,//TEST_PIN_NUM_LCD_RST,
        .rgb_ele_order = LCD_RGB_ELEMENT_ORDER_RGB,
        .bits_per_pixel = 16,//TEST_LCD_BIT_PER_PIXEL,
        .vendor_config = &vendor_config,
    };
    
    ESP_ERROR_CHECK(esp_lcd_new_panel_ek79007(mipi_dbi_io, &panel_config, &panel_handle));
    ESP_ERROR_CHECK(esp_lcd_dpi_panel_enable_dma2d(panel_handle));
    ESP_ERROR_CHECK(esp_lcd_panel_reset(panel_handle));
    ESP_ERROR_CHECK(esp_lcd_panel_init(panel_handle));

    bsp_enable_backlight();

    // สร้าง Semaphore สำหรับรอ DMA2D
    s_draw_done_sem = xSemaphoreCreateBinary();
    xSemaphoreGive(s_draw_done_sem); // อนุญาตให้วาดเฟรมแรกได้ทันที

    // ลงทะเบียน Event Callback เข้ากับ DPI Panel
    //esp_lcd_dpi_panel_event_callbacks_t cbs = {
    //    .on_color_trans_done = on_color_trans_done_cb,
    //};
    //ESP_ERROR_CHECK(esp_lcd_dpi_panel_register_event_callbacks(panel_handle, &cbs, NULL));

    // 1. เริ่มระบบ I2C Master Bus (IDF v6.x Driver)
    i2c_master_bus_config_t i2c_bus_config = {
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .i2c_port = I2C_NUM_0,
        .scl_io_num = TOUCH_I2C_SCL,
        .sda_io_num = TOUCH_I2C_SDA,
        .glitch_ignore_cnt = 7,
        .flags.enable_internal_pullup = true,
    };
    i2c_master_bus_handle_t i2c_bus_handle;
    ESP_ERROR_CHECK(i2c_new_master_bus(&i2c_bus_config, &i2c_bus_handle));

    vTaskDelay(pdMS_TO_TICKS(50));

