Neothai/esp32p4_test/main/main.c
    esp32_mp3dec_hw_init(&mp3, I2S_MCLK_IO, I2S_BCLK_IO, I2S_WS_IO, I2S_DOUT_IO, I2S_GPIO_UNUSED);

    // พัก 50ms ให้สัญญาณนาฬิกา MCLK เสถียร
    vTaskDelay(pdMS_TO_TICKS(50));

    // 2. ค่อยส่งคำสั่ง I2C ไปปลุกชิป ES8311
    es8311_codec_init(i2c_bus_handle);

    // 3. เปิดเพาเวอร์แอมป์ขับลำโพง
    bsp_enable_speaker_pa();

    const lvgl_port_display_cfg_t disp_cfg = {
        .panel_handle = panel_handle,
        .buffer_size = LCD_H_RES * LCD_V_RES,
        .double_buffer = true,
        .hres = LCD_H_RES,
        .vres = LCD_V_RES,
        .monochrome = false,
        .color_format = LV_COLOR_FORMAT_RGB565,
        .flags = {
            .swap_bytes = false,
            .buff_dma = false,
            .buff_spiram = true,
            .direct_mode = true,
            .sw_rotate = true,
        }
    };

    const lvgl_port_display_dsi_cfg_t dsi_cfg = {
        .flags = {
            .avoid_tearing = true, // เปิดสร้าง Semaphore รอ VSYNC เพื่อภาพไร้รอยฉีก
        }
    };

    const lvgl_port_cfg_t lvgl_cfg = ESP_LVGL_PORT_INIT_CONFIG();
    esp_err_t err = lvgl_port_init(&lvgl_cfg);

    // ใช้ฟังก์ชันเฉพาะของ MIPI-DSI
    lv_display_t *display = lvgl_port_add_disp_dsi(&disp_cfg, &dsi_cfg);

    setup_touchscreen(display);

    if(lvgl_port_lock(1000)){
      lv_demo_widgets();
    }
    lvgl_port_unlock();

vTaskDelay(pdMS_TO_TICKS(3000));

    sdmmc_host_t host = SDMMC_HOST_DEFAULT();
    host.slot = SDMMC_HOST_SLOT_0;
    host.max_freq_khz = SDMMC_FREQ_SDR50;

    esp_err_t host_err = sdmmc_host_init();
    if (host_err == ESP_OK) {
        ESP_LOGI("SD", "SDMMC Host Controller initialized by app_main");
    } else if (host_err == ESP_ERR_NOT_FOUND || host_err == ESP_ERR_INVALID_STATE) {
        ESP_LOGI("SD", "SDMMC Host Controller already initialized (shared with ESP-Hosted)");
    } else {
        // หากเกิดข้อผิดพลาดร้ายแรงอื่น ๆ ให้แจ้งเตือน
        ESP_ERROR_CHECK(host_err);
    }

    vTaskDelay(pdMS_TO_TICKS(500));

    sd_pwr_ctrl_ldo_config_t ldo_config = {
        .ldo_chan_id = 4,
    };
    sd_pwr_ctrl_handle_t pwr_ctrl_handle = NULL;

    esp_err_t ret = sd_pwr_ctrl_new_on_chip_ldo(&ldo_config, &pwr_ctrl_handle);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to create a new on-chip LDO power control driver");
        return;
    }
    host.pwr_ctrl_handle = pwr_ctrl_handle;
    host.current_limit = SDMMC_CURRENT_LIMIT_800MA;

    vTaskDelay(pdMS_TO_TICKS(500));

    /*
    // 2. ตั้งค่า Slot และจับคู่ GPIO โหมด 4-bit
    sdmmc_slot_config_t slot_config = SDMMC_SLOT_CONFIG_DEFAULT();
    slot_config.width = 4;
    slot_config.clk = PIN_NUM_CLK;
    slot_config.cmd = PIN_NUM_CMD;
    slot_config.d0 = PIN_NUM_D0;
    slot_config.d1 = PIN_NUM_D1;
    slot_config.d2 = PIN_NUM_D2;
    slot_config.d3 = PIN_NUM_D3;
    slot_config.flags |= SDMMC_SLOT_FLAG_INTERNAL_PULLUP;
    slot_config.flags |= SDMMC_SLOT_FLAG_UHS1;
    slot_config.cd = SDMMC_SLOT_NO_CD;
    slot_config.wp = SDMMC_SLOT_NO_WP;
    
    ESP_ERROR_CHECK(sdmmc_host_init_slot(host.slot, &slot_config));
    */

    esp_err_t init_res = sd_card_init_adaptive(&host, &s_card_info);
    if (init_res != ESP_OK) {
        ESP_LOGE("SD", "Failed to initialize SD card in all profiles! (Card missing or broken)");
        return;
    }

    //ESP_ERROR_CHECK(sdmmc_card_init(&host, &s_card_info));
    sdmmc_card_print_info(stdout, &s_card_info);

    // 4. ผูกการ์ดเข้ากับ diskio ของ FatFs
    diskio_register_sd_card(&s_card_info);

    xTaskCreate(sd_test, "sd", 8192, NULL, 5, NULL);
    xTaskCreate(console_task, "cli_task", 4096, NULL, 3, NULL);

    return;
}